Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/specific_debts.html.txt.tmx
Source language: en
Languages: ga

source: Rules for specific debts
ga: Rialacha a bhaineann le fiacha sonracha

source: • Social welfare overpayments and maintenance
ga: • Ró-íocaíochtaí leasa shóisialaigh agus íocaíochtaí cothabhála

source: • Waste and utility charges
ga: • Muirir dhramhaíola agus fóntas

source: • TV and dog licences
ga: • Ceadúnais theilifíse agus mhadra

source: • Collection of court fines
ga: • Fíneálacha cúirte a bhailiú

source: There are specific rules and practices in place in relation to certain debts
ga: Tá rialacha agus cleachtais shonracha i bhfeidhm maidir le fiacha áirithe

source: These are mainly debts that are owed to the State or to a State body and arise from statutory charges and levies; debts to providers of essential services, such as utility companies; and debts arising from statutory obligations, such as the obligation to pay maintenance to spouses and children
ga: Den chuid is mó is fiacha iad seo atá dlite don Stát nó do chomhlacht Stáit a eascraíonn as muirir agus srathuithe reachtúla, fiacha do sholáthróirí seirbhísí riachtanacha ar nós comhlachtaí fóntais agus fiacha a eascraíonn as oibleagáidí reachtúla, cosúil leis an oibleagáid cothabháil a íoc le céilí agus leanaí

source: The Civil Debt (Procedures) Act 2015 (when in force) will change the arrangements for the enforcement of civil debt. Read more in this press release
ga: Athróidh an tAcht um Fhiachas Sibhialta (Nósanna Imeachta), 2015 na cleachtais maidir le fiachas sibhialta nuair a bheidh sé i bhfeidhm

source: Specific rules and practices apply to the following:
ga: Baineann rialacha agus cleachtais shonracha leis na nithe seo a leanas:

source: In general, you are expected to pay your taxes on time and in full
ga: Go ginearálta, táthar ag súil go n-íocfaidh tú do chánacha in am agus ina n-iomláine

source: If you fail to do this, Revenue has a range of options for collecting the tax due
ga: Má theipeann ort é seo a dhéanamh, tá raon roghanna ag na Coimisinéirí Ioncaim maidir le bailiú na cánach atá dlite

source: If you fail to pay your tax on time, you may be prosecuted and convicted of an offence
ga: Má theipeann ort do cháin a íoc in am, is féidir thú a ionchúiseamh agus a chiontú i gcion

source: This may lead to a fine and/or imprisonment
ga: D'fhéadfadh fíneáil agus/nó príosúnacht a bheith mar thoradh air seo

source: The level of fines and length of imprisonment vary in accordance with the gravity of the different offences under revenue law
ga: D'fhéadfadh leibhéal na bhfíneálacha agus fad na príosúnachta a athrú i gcomhréir le tromchúis na gcionta éagsúla faoin dlí ioncaim

source: Regardless of the outcome of the prosecution, you are still obliged to repay the underpayment
ga: Beag beann ar thoradh an ionchúisimh, beidh ort an ganníocaíocht a aisíoc fós

source: The main ways in which Revenue collects overdue taxes from individuals are as follows:
ga: Is iad seo na príomhbhealaí a mbailíonn na Coimisinéirí Ioncaim cánacha atá thar téarma ó dhaoine aonair:

source: If you owe money to Revenue for unpaid taxes, you may be able to agree a repayment arrangement
ga: Má tá airgead dlite agat do na Coimisinéirí Ioncaim le haghaidh cánacha neamhíoctha, d'fhéadfá a bheith in ann socrú aisíoca a aontú

source: However, in general, interest applies to any late taxes and so you have to pay this as well
ga: Mar sin féin, i gcoitinne, bíonn ús le híoc ar chánacha déanacha ar bith agus mar sin caithfidh tú é seo a íoc chomh maith

source: In some cases, penalties may also apply
ga: I roinnt cásanna, d'fhéadfadh pionóis a fheidhmiú freisin

source: If you are paying income tax through PAYE and you underpay in a particular year, you may be able to pay the amount due by having your tax credits in a subsequent year reduced
ga: Má tá tú ag íoc cháin ioncaim trí ÍMAT agus ma ghearríocann tú in aon bhliain ar leith, d'fhéadfá a bheith in ann an méid atá dlite a íoc trí do chreidmheasanna cánach sa bhliain ina dhiaidh sin a laghdú

source: In general, interest is not applied in these circumstances
ga: Go ginearálta, ní chuirtear ús ar an íocaíocht sna cásanna áirithe seo

source: In other cases where you have not paid or have underpaid your tax, you may be able to agree a phased payment arrangement
ga: I gcásanna eile nach bhfuil do cháin íoctha agat nó má tá sí gearríoctha, d'fhéadfá a bheith in ann socrú íocaíochta de réir a chéile a aontú

source: This generally does involve the payment of interest as well as the amount owed
ga: Go ginearálta baineann íocaíocht úis leis seo, chomh maith leis an méid atá dlite

source: If you get a final demand for the payment of any taxes due and you do not respond, Revenue may refer your case to the Sheriff for enforcement
ga: Má fhaigheann tú éileamh deiridh ó na Coimisinéirí Ioncaim le haghaidh cánacha dlite a íoc agus mura bhfreagraíonn tú, féadfaidh na Coimisinéirí Ioncaim do chás a tharchur chuig an Sirriam maidir le forfheidhmiú

source: It is not necessary to have a court order
ga: Ní gá aon ordú cúirte

source: The Sheriff is given a warrant, which is a legal document conferring authority on the Sheriff to enforce collection of Revenue liabilities, if necessary, by seizing goods
ga: Tugtar barántas, cáipéis dlíthiúil, don Sirriam a thugann údarás don Sirriam bailiúchán dliteanas na gCoimisinéirí Ioncaim a fhorfheidhmiú, más gá, trí earraí a ghabháil

source: A warrant is valid for 12 months
ga: Tá barántas bailí ar feadh 12 mhí

source: However, if the Sheriff fails to collect any of the liability within 6 months, the certificate must be returned to Revenue
ga: Mar sin féin, má theipeann ar an Sirriam aon chuid den dliteanas a bhailiú laistigh de 6 mhí, ní mór an deimhniú a chur ar ais chuig na Coimisinéirí Ioncaim

source: The Sheriff has the authority to negotiate a payment arrangement, not exceeding 2 years, with you
ga: Tá an t-údarás ag an Sirriam idirbheartaíocht íocaíochta a shocrú leat, nach mairfidh níos mó ná dhá bhliain

source: Once your case has gone to the Sheriff, you must then deal with the Sheriff
ga: Nuair a chuirtear do chás chuig an Sirriam, ní mór duit ansin déileáil leis

source: You cannot now deal with Revenue officials as this is part of Revenue’s agreement with the Sheriffs
ga: Ní féidir leat déileáil le hoifigigh na gCoimisinéirí Ioncaim de bharr go bhfuil sé seo mar chuid de chomhaontú na gCoimisinéirí Ioncaim leis na Sirriamaí

source: Revenue Sheriffs are officers of the courts and are responsible to the courts
ga: Is oifigigh na gcúirteanna iad Sirriamaí na gCoimisinéirí Ioncaim agus tá siad freagrach do na cúirteanna

source: There is a Code of Practice for Revenue Sheriffs (pdf)
ga: Tá Cód Cleachtais le haghaidh Sirriamaí na gCoimisinéirí Ioncaim (pdf)

source: Revenue has contracts with several firms of solicitors to help enforce Revenue debts
ga: Tá conarthaí ag na Coimisinéirí Ioncaim le roinnt ghnólachta d'aturnaetha chun cabhrú leo fiacha a fhorfheidhmiú

source: They are involved in taking cases through the courts
ga: Tá siad páirteach i gcásanna a thógáil trí na cúirteanna ar an ngnáthbhealach

source: If the court grants a judgment order, it is enforced in the normal way
ga: Má tá orduithe breithiúnais arna ndeonú ag na cúirteanna, cuirtear na horduithe seo i bhfeidhm ar an ngnáthbhealach

source: Revenue has specific powers of attachment of debt, which can be exercised without a court order
ga: Tá cumhachtaí sonracha ag na Coimisinéirí Ioncaim maidir le fiach a cheangal gur féidir a fheidhmiú gan ordú cúirte

source: Read more about how this works
ga: Léigh tuilleadh ar revenue.ie

source: If you are a liable person for the Local Property Tax (LPT) and you do not submit a return, the estimate made by Revenue will become payable by default
ga: Má tá tú faoi dhliteanas íoc as Cáin Mhaoine Áitiúil (CMÁ) agus mura seolann tú tuairisceán ar ais, beidh an meastachán a rinne na Coimisinéirí Ioncaim iníoctha trí mhainneachtain

source: Revenue will then collect the amount due in the normal ways, such as deduction at source or attachment order
ga: Baileoidh na Coimisinéirí an tsuim atá dlite ansin ar na gnáthbhealaí, ar nós í a laghdú ag an bhfoinse nó trí ordú astaithe

source: If Revenue cannot collect the amount of LPT due, for whatever reason, then a charge will be put on your property
ga: Mura mbailíonn na Coimisinéirí Ioncaim an méid den CMÁ atá dlite, ar pé cúis, cuirfear muirear ar do mhaoin

source: You will not be able to sell your property without paying the accumulated tax together with interest and, where appropriate, penalties
ga: Ní bheidh tú in ann do mhaoin a dhíol gan an cháin charnach a íoc, anuas ar an ús agus, sa chás gur cuí, pionóis

source: Read more about the Local Property Tax
ga: Is féidir leat níos mó a léamh faoi Cháin Mhaoine Áitiúil anseo

source: A Household Charge of €100 was charged on residential property in 2012
ga: Gearradh Muirear Teaghlaigh €100 ar mhaoin chónaithe in 2012

source: If you owned a dwelling in 2012 and did not pay the Household Charge due on it by 1 July 2013, the Local Property Tax in respect of the property was increased by €200
ga: Má bhí áit chónaithe agat in 2012 agus murar íoc tú an Muirear Teaghlaigh a bhí le híoc air faoin 1 Iúil 2013, méadaíodh an Cháin Mhaoine Áitiúil maidir leis an maoin €200

source: In effect, the arrears were converted into LPT, to be collected through the LPT system and pursued by Revenue
ga: Go héifeachtach, iompaíodh na riaráistí ina CMÁ, a bhailítear tríd an gcóras CMÁ agus a dtéann na Coimisinéirí Ioncaim sa tóir orthu

source: Interest and penalties under the LPT system will apply to the additional €200
ga: Gearrfar ús agus pionóis faoin gcóras CMÁ ar an €200 sa bhreis

source: Non-principal private residence (second home) charge
ga: Muirear um Áit Chónaithe Phríobháideach Neamhphríomha (dara baile)

source: The Non-Principal Private Residence (NPPR) charge was payable on any second residence that you owned in any year between 2009 and 2013 inclusive
ga: Bhí an muirear um Áit Chónaithe Phríobháideach Neamhphríomha iníoctha ar dara áit chónaithe ar bith a bhí i do sheilbh idir 2009 agus 2013

source: Late payment fees and penalties applied if you did not pay the charge by the liability date each year
ga: Má theip ort an muirear a íoc in am, bhí tú faoi réir táille dhéanach de €20 in aghaidh na míosa a íoc

source: If you were liable for the full period and did not pay (or agree terms) by 31 August 2014, you now owe a total of €7,230 on the property
ga: Ma bhí an muirear iníoctha agat ar feadh na tréimhse 2009 go 2013 (5 bhliain) agus munar íoc tú é roimh 31 Lúnasa 2014, tá ort anois €7,230 a íoc

source: Any unpaid charges or unpaid late payment fees remain as a charge on the property and are payable if it is sold or passed on inheritance
ga: Fanann aon táillí neamhíoctha nó táillí íocaíocht déanacha mar mhuirear ar an maoin agus tá siad iníoctha má dhíoltar an mhaoin nó má thugtar ar aghaidh ina hoidhreacht í

source: Social welfare overpayments and maintenance
ga: Ró-íocaíochtaí leasa shóisialaigh agus íocaíochtaí cothabhála

source: If you have received money from the Department of Social Protection that you should not have received, you are generally legally obliged to repay it
ga: Má fuair tú airgead ón Roinn Coimirce Sóisialaí nár chóir duit a fháil, tá tú faoi oibleagáid dhlíthiúil é a aisíoc

source: This is the case whether the overpayment arises as a result of fraud, a mistake by you or a mistake by the Department
ga: Is é seo an cás cibé an dtarlaíonn an ró-íocaíocht de bharr calaoise, de bharr botúin agatsa nó de bharr botúin ag an Roinn

source: Read more about how the Department deals with social welfare overpayments
ga: Léigh tuilleadh faoi conas a ndéileálann an Roinn le ró-íocaíochtaí leasa shóisialaigh

source: If a parent, spouse or civil partner falls behind with maintenance payments that are due to you under a maintenance order, you can apply to the court for an attachment of earnings order if the person is in employment or on a private pension
ga: I gcásanna ina dteipeann ar thuismitheoir/chéile/pháirtnéir sibhialta ordú cúirte a chomhlíonadh agus nach n-íocann sé/sí an méid a dámhadh faoi ordú cothabhála, féadtar ordú astú tuillimh a lorg ón gcúirt, má tá an duine fostaithe nó má tá pinsean príobháideach á fháil aige/aici

source: This order results in the maintenance amount being deducted at source by the person's employer
ga: Is éard a eascraíonn as an ordú seo ná go n-asbhaineann fostóir an tuismitheora/an chéile/an pháirtnéara shibhialta suim na cothabhála ag an bhfoinse

source: If the person is self-employed, you can apply for an enforcement order
ga: Má tá an tuismitheoir/céile/páirtnéir sibhialta féinfhostaithe, féadtar iarratas a dhéanamh ar toghairm forfheidhmithe

source: If the person lives abroad, you can contact the Central Authority for Maintenance Recovery
ga: Má tá an tuismitheoir/céile/páirtnéir sibhialta ina chónaí thar lear, is féidir leat teangmháil a dhéanamh leis an Údarás Lárnach um Aisghabháil Cothabhála

source: You will need to provide the person’s address
ga: Ní mór go bhfuil seoladh agat don pháirtí eile

source: Read more in our document on Maintenance orders and agreements
ga: Léigh tuilleadh inár ndoiciméad Orduithe agus comhaontuithe cothabhála

source: If you fall behind in your local authority rent, the local authority must follow detailed guidelines for dealing with arrears
ga: Má tá tú ag titim chun deiridh le do chíos údaráis áitiúla, ní mór don údarás áitiúil an cód cleachtais a leanúint chun déileáil le riaráistí

source: Some local authority rent schemes may allow for a rent reduction in cases of hardship
ga: D'fhéadfadh roinnt scéimeanna chíos údaráis áitiúla laghdú cíosa i gcásanna cruatain a cheadú

source: If you fail to pay your rent, the legal consequences can include:
ga: Iarmhairtí a bhaineann le loiceadh ar chíos a íoc

source: • Being charged interest at a rate of 6% on the arrears as long as they remain unpaid
ga: • Ús ag ráta de 6% a ghearradh ort ar na riaráistí fad is a bhfanann siad neamhíoctha

source: • Notice to quit, followed by repossession of your home
ga: • Fógra fágála, agus do theach a athshealbhú ina dhiaidh sin

source: • Ineligibility for further social housing support
ga: • Neamhcháilitheacht ar thacaíocht tithíochta sóisialta amach anseo

source: Read more about how local authorities deal with rent arrears
ga: Léigh tuilleadh faoi conas a ndéileáileann údaráis áitiúla le riaráistí cíosa

source: Local authority loan arrears
ga: Riaráistí iasachta údaráis áitiúla

source: If you have a loan from a local authority for buying or improving your house and you are having difficulty making your repayments, you may be able to make an arrangement with the local authority
ga: Má tá iasacht agat ó údarás áitiúil chun do theach a cheannach nó a fheabhsú agus má tá deacracht agat do chuid aisíocaíochtaí a dhéanamh, d'fhéadfá a bheith in ann socrú a dhéanamh leis an údarás áitiúil

source: Detailed guidelines (pdf) have been issued to local authorities on how to deal with such cases
ga: Tá treoir d’údaráis áitiúla maidir le conas déileáil le riaráistí morgáiste (pdf)

source: These guidelines are based on the Central Bank's Code of Conduct on Mortgage Arrears (pdf)
ga: Bunaíodh an treoir seo ar chód iompraíochta an Bhainc Cheannais ar riaráistí morgáiste (pdf)

source: Read more on housing.gov.ie
ga: Léigh tuilleadh ar housing.gov.ie

source: Waste and utility charges
ga: Muirir dhramhaíola agus fóntas

source: If you have not paid the charge levied by your refuse collection operator for the collection of waste within 2 months of the due date (and you are not eligible for a waiver) the operator may take court proceedings against you for the payment as a simple contract debt
ga: Murar íoc tú an muirear gearrtha ag do sheirbhís bhailithe bruscair chun dramhaíl a bhailiú laistigh de dhá mhí ón dáta dlite (agus nach bhfuil tú incháilithe le haghaidh tarscaoileadh) féadfaidh an tseirbhís bhailithe bruscair imeachtaí cúirte a thógáil i do choinne an íocaíocht a dhéanamh mar fhiach conartha shimplí

source: It is not an offence to fail to pay
ga: Ní cion é má theiptear ar íoc

source: Read more about waste charges
ga: Léigh tuilleadh faoi mhuirir dhramhaíola

source: Utilities: electricity, gas, water
ga: Fóntais: leictreachas, gás, uisce

source: Suppliers of electricity, gas and water are required by their regulator, the Commission for Energy Regulation (CER), to have codes of practice for dealing with customers who have difficulties paying their bills and build up arrears of payments
ga: Is gá do sholáthraithe leictreachais, gáis agus uisce ag a rialtóir, an Coimisiún um Rialáil Fuinnimh, cóid chleachtais a bheith acu chun déileáil le custaiméirí a bhfuil deacrachtaí acu a gcuid billí a íoc agus a thógann riaráistí íocaíochtaí

source: Each of these regulated utilities must publish these codes of practice – you can check on the websites of your electricity supplier, your gas supplier and Irish Water
ga: Tá ar gach eintiteas rialaithe na cóid seo a fhoilsiú - is féidir seicáil ar láithreán gréasáin do sholáthraí leictreachais, do sholáthraí gáis agus Uisce Éireann

source: If you are having difficulty (or are likely to have difficulty) paying your utility bills, it is very important to contact your supplier as soon as possible
ga: Má tá deacracht agat, nó ar dóigh deacracht a bheith agat, ag íoc do chuid billí fóntais, tá sé an-tábhachtach teagmháil a dhéanamh le do sholáthraí chomh luath agus is féidir

source: Options that can be put in place with your supplier might include setting up a budget plan, spreading your payments across the year, installing a pre-paid meter or using a pre-paid card
ga: Is féidir leis na roghanna seo a leanas a bheith curtha i bhfeidhm ag do sholáthraí; plean buiséad a bhunú, ag scaipeadh bhur n-íocaíochtaí ar fud na bliana, méadar réamh-íoctha a shuiteáil nó úsáid a bhaint as cárta réamh-íoctha

source: Read more about gas, electricity and water charges
ga: Léigh tuilleadh faoin mhuirir leictreachais, gáis agus uisce

source: TV and dog licences
ga: Ceadúnais theilifíse agus mhadra

source: TV licence fees are payable to An Post
ga: Tá táillí cheadúnas teilifíse iníoctha le ‘An Post’

source: (The Minister for Communications, Climate Action and Environment may designate another body as the 'issuing agent' but at present it is An Post.)
ga: (Is féidir leis an Aire Cumarsáide, Gníomhaithe ar son na hAeráide agus Comhshaoil comhlacht eile a ainmniú mar an 'gníomhaire eisiúna' ach faoi láthair is An Post é.)

source: If An Post considers that you do not have a TV licence and you are obliged to have one, it may send you a reminder notification, giving you 28 days to pay
ga: Má mheasann An Post nach bhfuil ceadúnas teilifíse agat nuair a chaithfidh tú ceann a bheith agat, féadfaidh sé fógra cuimhniúcháin a sheoladh chugat. Tugann sé seo 28 lá duit le híoc

source: If, after 2 such notifications, you do not pay the licence fee, An Post may serve you with a fixed payment notice
ga: Más rud é, tar éis dhá fógra den tsórt sin, nach n-íocann tú an táille cheadúnais, féadfaidh An Post fógra íocaíochta socraithe a sheirbheáil duit

source: You now have 21 days in which to buy your TV licence and pay the fixed payment penalty, which is capped at one-third of the licence fee
ga: Anois tá 21 lá agat do cheadúnas teilifíse a cheannach agus an táille sheasta a íoc. Tá an táille sheasta socraithe ag aon trian den táille cheadúnais

source: If you do not buy your TV licence and pay the fixed payment fee, you may be prosecuted in the District Court, as it is an offence not to have a TV licence if you have a TV set
ga: Mura gceannaíonn tú do cheadúnas teilifíse agus má íocann tú an táille sheasta, féadfaidh thú a ionchúiseamh sa Chúirt Dúiche, toisc gur cion é gan cheadúnas teilifíse a bheith agat má tá teilifíseán agat

source: The fine for a first offence can be up to €1,000
ga: Is é uasmhéid na fíneála don chéad chiontú €1,000

source: For subsequent offences, you can be fined up to €2,000
ga: Is €2,000 é don dara cion nó d'aon chion ina dhiaidh sin

source: An Post may look for judgment for the outstanding payments as a simple contract debt
ga: Is féidir leis An Post breithiúnas chun íocaíochtaí neamhíoctha a lorg mar fhiach conartha shimplí

source: If you have a dog over 4 months old, you must have a dog licence for it
ga: Má tá madra agat atá níos mó ná ceithre mhí d'aois, ní mór duit ceadúnas madra a bheith agat dó

source: If you do not have a licence for your dog, you are liable to an 'on-the-spot' fine
ga: Más rud é nach bhfuil ceadúnas agat do do mhadra, tá tú faoi dhliteanas fíneáil 'ar an láthair' a fháil

source: Failure to pay this fine can lead to a prosecution, with a maximum fine of €2,500 and/or up to 3 months' imprisonment if convicted
ga: Mura n-íocann tú an fhíneáil seo is féidir thú a ionchúiseamh, le fíneáil uasmhéide de €2,500 agus/nó suas le 3 mhí i bpríosún má chiontaítear thú

source: The debt may be collected as a simple contract debt
ga: Féadfar an fiach a bhailiú mar fhiach conartha shimplí

source: Read more in our document on Control of dogs
ga: Léigh tuilleadh inár ndoiciméad ar Rialú madraí

source: Collection of court fines
ga: Fíneálacha cúirte a bhailiú

source: The Fines (Payments and Recovery) Act 2014 introduces some new features in how court fines are treated, including the possibility of paying a fine by instalments or of having a fine treated and enforced as a civil debt
ga: Tugann an tAcht Fíneálacha (Íoc agus Gnóthú) 2014 isteach roinnt gnéithe nua ar an gcaoi a phléitear le fíneálacha cúirte, lena n-áirítear an fhéidearthacht fíneáil a íoc i dtráthchodanna nó go mbeadh fíneáil cóireáilte agus curtha i bhfeidhm mar fhiach síbhialta

source: For once-off payment of a fine, you can opt to pay through An Post or else pay the Courts Service directly
ga: Tá córas íocaíochta i dtráthchodanna ar fáil i gcás gach fíneálach chúirte os cionn €100

source: If you are paying by instalments, you can only pay through An Post
ga: Cuireadh an socrú seo i bhfeidhm trí Rialacháin 2016

source: If you fail to pay a fine, you can be brought back to court
ga: Má theipeann ort fíneáil a íoc, féadtar thú a thabhairt ar ais chun na cúirte

source: The judge may make an attachment order or a recovery order, to collect the money from you directly, or they can order you to do community service
ga: Féadfaidh an breitheamh ordú astaithe nó ordú gnóthaithe a dhéanamh, chun an t-airgead a bhailiú uait go díreach, nó féadfaidh siad a ordú go ndéanann tú seirbhís pobail

source: If none of these options is appropriate, or if you fail to comply with a community service order, you may be sent to prison for a length of time that relates to the amount of the unpaid fine
ga: Mura cuí d’aon cheann de na roghanna seo, nó má theipeann ort ordú seirbhíse pobail a chomhlíonadh, féadtar thú a chur chun príosúin ar feadh fad ama atá i gcomhréir le méid na fíneála gan íoc

source: Read more in this press release
ga: Léigh tuilleadh sa phreasráiteas seo
